x = int(input("X軸座標:"))
y = int(input("Y軸座標:"))
if (x>0)&(y>0):
    print("該點位於第一象限，離原點距離為根號%d" %(x**2 + y**2))
elif (x<0)&(y>0):
    print("該點位於第二象限，離原點距離為根號%d" %(x**2 + y**2))
elif (x<0)&(y<0):
    print("該點位於第三象限，離原點距離為根號%d" %(x**2 + y**2))
elif (x>0)&(y<0):
    print("該點位於第四象限，離原點距離為根號%d" %(x**2 + y**2))
elif (x<0)&(y==0):
    print("該點位於左平面X軸上，離原點距離為根號%d" %(x**2 + y**2))
elif (x>0)&(y==0):
    print("該點位於右平面X軸上，離原點距離為根號%d" %(x**2 + y**2))
elif (x==0)&(y==0):
    print("該點位於原點")
elif (x==0)&(y>0):
    print("該點位於上平面Y軸上，離原點距離為根號%d" %(x**2 + y**2))
elif (x==0)&(y<0):
    print("該點位於下平面Y軸上，離原點距離為根號%d" %(x**2 + y**2))